# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C implementation of the BLAKE3 cryptographic hash function
brew "blake3"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Cross-platform make
brew "cmake"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Command-line benchmarking tool
brew "hyperfine"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Modern replacement for ps written in Rust
brew "procs"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Program that allows you to count code, quickly
brew "tokei"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Virtual Audio Driver
cask "blackhole-2ch"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iZip Unarchiver", id: 717545828
mas "Keynote", id: 361285480
mas "LINE", id: 539883307
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
cargo "avm"
cargo "cargo-audit"
cargo "cargo-binstall"
cargo "cargo-bloat"
cargo "cargo-edit"
cargo "cargo-trim"
cargo "cargo-update"
cargo "cargo-watch"
cargo "dioxus-cli"
cargo "honggfuzz"
cargo "idlgen"
cargo "kani-verifier"
cargo "loco"
cargo "mdbook"
cargo "mdbook-mermaid"
cargo "mdbook-svgbob2"
cargo "quasar-cli"
cargo "rustlings"
cargo "rustowl"
cargo "sccache"
cargo "solana-verify"
cargo "trident-cli"
cargo "trunk"
cargo "wasm-bindgen-cli"
cargo "wasm-pack"
